#include "timer.h"

unsigned int timerCount = 0; //переменная для таймера
unsigned int timerEnd = 1000; //конец счета таймера

////*************установка значения обнуления таймера*****************
//void setTimerEnd(unsigned int tic){
	//
//}

//***********получение тукущего значения таймера*************
char getTimerCount(){ return timerCount; }
	
//*************установка текущего значения таймера***************
void setTimerCount(unsigned int num){ timerCount = num; }

//*********************инициализация таймера**************************
void timer_ini(void)
{
	TCCR1B |= (1<<WGM12); // устанавливаем режим СТС (сброс по совпадению)
	TIMSK |= (1<<OCIE1A); //устанавливаем бит разрешения прерывания 1ого счетчика по совпадению с OCR1A(H и L)
	OCR1AH = 0b10011000; //записываем в регистр число 62500 для сравнения. 0b11110100(8сек) 0b01111010(4сек) 0b10011000(5c)
	OCR1AL = 0b10010110; // 0b00100100(8сек) 0b00010010(4сек) 0b10010110(5c)
	TCCR1B |= (1<<CS12)|(1<<CS10);//установим делитель на 1024, выставим бит CS12 и CS10 в 1. на этот делитель мы поделим 8000000
}
//***********************обработчик прерываний от таймера****************
ISR (TIMER1_COMPA_vect)
{
	if(timerCount > timerEnd) timerCount=0; 
	timerCount++;
}